package pro.sky.telegrambot.service;

public class InfoPetsService {

    public String datingRules(){
        //получает и выводит список правил для знакомства с будущим питомцем, путем получения информации из бд.
        return "";
    }

    public String documentsList(){
        //получает и выводит список документов, необходимых для того, чтобы взять питомца, информация тянется из бд.
        return "";
    }

    public String transportRecommendation(){
        //получает и выводит список рекомендаций по транспортировке, информация тянется из бд.
        return "";
    }

    public String homeImprovementPuppy(){
        //получает и выводит список рекомендаций по обсутройству дома для щенка, информация тянется из бд.
        return "";
    }

    public String homeImprovementDog(){
        //получает и выводит список рекомендаций по обсутройству дома для взрослой собаки, информация тянется из бд.
        return "";
    }

    public String homeImprovementDisabledDog(){
        //получает и выводит список рекомендаций по обсутройству дома для собаки с ограниченными возможностями, информация тянется из бд.
        return "";
    }

    public String cynolistTips(){
        //получает и выводит список рекомендаций кинолога по первичному общению с питомцем, информация тянется из бд.
        return "";
    }

    public String cynolistList(){
        //получает и выводит список доверенных кинологов, для последующего обращения, информация тянется из бд.
        return "";
    }

    public String bounceList(){
        //получает и выводит список почему могут откзать и не дать забрать собаку, информация тянется из бд.
        return "";
    }
}
